dt = 0.0001;
t = -0.05:dt:0.05;
x = sinc(1000*t);

% α) γραφική παράσταση του σήματος x(t)
subplot(3,1,1)
plot(t, x);
title('α) Γραφική Παράσταση x(t)')
xlabel('Χρόνος (t)');
ylabel('x(t)');
grid on;

%! Σε ποια χρονική στιγμή συμβαίνει ο πρώτος μηδενισμός του σήματος?
% Γενικά ένα ημίτονο είναι 0 όταν το t είναι k*π, όπου k=0,1,2,3,...
% Αρα για το sinc(1000t)= sin(1000πt)/(1000πt) θα έχουμε μηδενισμό όταν
% 1000πt = k*π => t = k/1000, όπου k=1,2,3,... (όχι 0 γιατί τότε και παρανομαστής 0)
% Επομένως, Ο πρώτος μηδενισμός του σήματος δηλαδή συμβαίνει στην χρονική στιγμή t = 1 / 1000 (k = 1)
% ο δεύτερος για t = 2 / 1000 (k = 2) κτλ.

% oρισμός χρόνου μηδενισμού του σήματος
hold on;
t_zero = 1 / 1000;       
% γράφημα του σημείου πρώτου μηδενισμού του σήματος x
plot(t_zero, 0, 'ro');   % όταν x(t) = 0 πλοτάρουμε το t με κόκκινο κύκλο ('ro')

% β) φάσμα πλάτους του σήματος

% Υπολογισμός των συχνοτήτων
BW = 1/dt;              % εύρος ζώνης που ορίζεται από τη δειγματοληψία στο χρόνο
N = length(x);          % το πλήθος των σημείων του σήματος
df = BW/N;              % η δειγματοληψία στο πεδίο των συχνοτήτων
f = -BW/2:df:(BW/2-df); % οι συχνότητες

% Υπολογισμός του φάσματος πλάτους
Xf = fft(x);
Xf = fftshift(Xf)/N;

% Απεικόνιση του φάσματος πλάτους
subplot(3,1,2);
plot(f, abs(Xf));
title('β) Φάσμα Πλάτους');
xlabel('Συχνότητα (Hz)');
ylabel('|X(f)|');
grid on;

%! Ποιο είναι θεωρητικά το εύρος του φάσματος πλάτους του σήματος?
% Το εύρος του φάσματος πλάτους του σήματος είναι ανάλογο με το εύρος ζώνης του σήματος στο χρόνο δία 2.
% BW/2 = 1/0.0001*2 = 5000 Hz
% Συνεπώς, το εύρος του φάσματος πλάτους του σήματος είναι από -5000 Hz έως 5000 Hz όπως φαίνετια και στο σχήμα

% γ) το φάσμα φάσης του σήματος
subplot(3,1,3);
plot(f, angle(Xf)); % η συνάρτηση angle(Xf) επιστρέφει τη φάση του Xf
title('γ) Φάσμα Φάσης');
xlabel('Συχνότητα (Hz)');
ylabel('Φάση');
grid on;

figure;
t1 = t + 0.01;
x1 = sinc(1000*t1);

% δ) γραφική παράσταση του σήματος x1(t)
subplot(3,1,1);
plot(t1, x);
title('δ) Γραφική Παράσταση x1(t)');
xlabel('Χρόνος (t)');
ylabel('x1(t)');
grid on;

% ε) το φάσμα πλάτους του σήματος x1(t)

% Υπολογισμός των συχνοτήτων
BW = 1/dt;                  % εύρος ζώνης που ορίζεται από τη δειγματοληψία στο χρόνο
N1 = length(x1);            % το πλήθος των σημείων του σήματος
df1 = BW/N;                 % η δειγματοληψία στο πεδίο των συχνοτήτων
f1 = -BW/2:df1:(BW/2-df1);  % οι συχνότητες

% Υπολογισμός του φάσματος
Xf1 = fft(x1);
Xf1 = fftshift(Xf1)/N1;

% Απεικόνιση του φάσματος πλάτους
subplot(3,1,2);
plot(f, abs(Xf1));
title('ε) Φάσμα Πλάτους');
xlabel('Συχνότητα (Hz)');
ylabel('|X(f)|');
grid on;

% ζ) το φάσμα φάσης του σήματος x1(t)
subplot(3,1,3);
plot(f, angle(Xf1)); % η συνάρτηση angle(Xf) επιστρέφει τη φάση του Xf
title('ζ) Φάσμα Φάσης');
xlabel('Συχνότητα (Hz)');
ylabel('Φάση');
grid on;