% Αποδιαμόρφωση σήματος (με μη ιδανικό τοπικό ταλαντωτή)
ph = 0.1 * pi;                 % φάση
lo = cos(2*pi*fc*t2 + ph).';   % Μη ιδανικός τοπικός ταλαντωτής

% Αποδιαμόρφωση του x
x2_out=x.*lo;       % αποδιαμορφωμένο σήμα x

order = 10;         % Τάξη φίλτρου
fcut = fs/10;       % Συχνότητα αποκοπής χαμηλοπερατού φίλτρου 
fcenter = 0;        % Κέντρο φίλτρου

% Φιλτράρισμα του σήματος x2
% Με τη χρήση χαμηλοπερατού φίλτρου κρατάμε μόνο το σήμα βασικής ζώνης
dt = T0;
demod=butterworth_filter(x2_out, dt, order, fcut, fcenter);

% Γραφική παράσταση αποδιαμορφωμένου σήματος
figure;
plot(t2,real(demod));
title('Αποδιαμορφωμένο σήμα');
xlabel('Χρόνος(t)');
ylabel ('Πλάτος');
grid on;

% Παίξιμο του αποδιαμορφωμένου σήματος
sound(real(demod), fs);

%! Είναι αντιληπτό το σήμα ομιλίας?
% Ναι, είναι αντιληπτό το σήμα ομιλίας.