f = 40;
FS = 2000;
T0 = 1/FS;
dt = T0/100;
t = 0:dt:1.5;
x = 12*sin(f*2*pi*t + 2*pi/3);

subplot(2,1,1);
plot(t, x);
title('Γραφική παράσταση του x(t)');
xlabel('t');
ylabel('x(t)');
grid on;

% Υπολογισμός του φάσματος
BW = 1/dt;              % εύρος ζώνης που ορίζεται από τη δειγματοληψία στο χρόνο
N = length(x);          % το πλήθος των σημείων του σήματος
df = BW/N;              % η δειγματοληψία στο πεδίο των συχνοτήτων
f = -BW/2:df:(BW/2-df); % πεδίο συχνότητας

Xf = fft(x);
Xf = fftshift(Xf)/N;

subplot(2,1,2);
plot(f, abs(Xf));
title('Φάσμα Πλάτους');
xlabel('Συχνότητα (Hz)');
ylabel('|X(f)|');
grid on;

%! Συγκρίνετε το φάσμα πλάτους που απεικονίζεται στη γραφική 
%! παράσταση με τη θεωρητική έκφραση του φάσματος πλάτους του ημιτόνου