dt = 0.0001;
t = -0.05:dt:0.05;
x = sinc(2000*t);

% α) γραφική παράσταση του σήματος x(t)
subplot(3,1,1)
plot(t, x);
title('α) Γραφική Παράσταση x(t)')
xlabel('Χρόνος (t)');
ylabel('x(t)');
grid on;

%! Σε ποια χρονική στιγμή συμβαίνει ο πρώτος μηδενισμός του σήματος?
% Γενικά ένα ημίτονο είναι 0 όταν το t είναι k*π, όπου k=0,1,2,3,...
% Αρα για το sinc(2000t)= sin(2000πt)/(2000πt) θα έχουμε μηδενισμό όταν
% 2000πt = k*π => t = k/2000, όπου k=1,2,3,... (όχι 0 γιατί τότε και παρανομαστής 0)
% Επομένως, Ο πρώτος μηδενισμός του σήματος δηλαδή συμβαίνει στην χρονική στιγμή t = 1 / 2000 (k = 1)
% ο δεύτερος για t = 2 / 2000 (k = 2) κτλ.

% oρισμός χρόνου μηδενισμού του σήματος
hold on;
t_zero = 1 / 2000;       
% γράφημα του σημείου πρώτου μηδενισμού του σήματος x
plot(t_zero, 0, 'ro');   % όταν x(t) = 0 πλοτάρουμε το t με κόκκινο κύκλο ('ro')

% β) το φάσμα πλάτους του σήματος x(t)

BW = 1/dt;              % εύρος ζώνης που ορίζεται από τη δειγματοληψία στο χρόνο
N = length(x);          % το πλήθος των σημείων του σήματος
df = BW/N;              % η δειγματοληψία στο πεδίο των συχνοτήτων
f = -BW/2:df:(BW/2-df); % οι συχνότητες

% Υπολογισμός του φάσματος 
Xf = fft(x);
Xf = fftshift(Xf)/N;

% Απεικόνιση του φάσματος πλάτους
subplot(3,1,2);
plot(f, abs(Xf));
title('β) Φάσμα Πλάτους');
xlabel('Συχνότητα (Hz)');
ylabel('|X(f)|');
grid on;

% γ) το φάσμα φάσης του σήματος
subplot(3,1,3);
plot(f, angle(Xf)); % η συνάρτηση angle(Xf) επιστρέφει τη φάση του Xf
title('γ) Φάσμα Φάσης');
xlabel('Συχνότητα (Hz)');
ylabel('Φάση');
grid on;