% Αποδιαμόρφωση σήματος (με μη ιδανικό τοπικό ταλαντωτή)
ph_diff = 0.9 * pi * rand(size(t2));                 % Διαφορά φάσης
lo = cos(2*pi*fc*t2 + ph_diff).';   % Μη ιδανικός τοπικός ταλαντωτής

% Αποδιαμόρφωση του x
x2_out=x.*lo;       % αποδιαμορφωμένο σήμα x

order = 10;         % Τάξη φίλτρου
fcut = fs/10;       % Συχνότητα αποκοπής χαμηλοπερατού φίλτρου 
fcenter = 0;        % Κέντρο φίλτρου

% Φιλτράρισμα του σήματος x2
% Με τη χρήση χαμηλοπερατού φίλτρου κρατάμε μόνο το σήμα βασικής ζώνης
dt = T0;
demod=butterworth_filter(x2_out, dt, order, fcut, fcenter);

% Γραφική παράσταση αποδιαμορφωμένου σήματος
figure;
plot(t2,real(demod));
title('Αποδιαμορφωμένο σήμα');
xlabel('Χρόνος(t)');
ylabel ('Πλάτος');
grid on;

% Παίξιμο του αποδιαμορφωμένου σήματος
sound(real(demod), fs);

%! Είναι αντιληπτό το σήμα ομιλίας? 
% Οχι, δεν είναι αντιληπτό το σήμα ομιλίας γιατί έχει πολύ θόρυβο.
%! Συγκρίνετε τις τρεις περιπτώσεις (άσκηση 8,9,10) και σχολιάστε.