% Τιμές για τον λόγο Eb/N0
Eb_N0 = 0:0.1:40;

% Υπολογισμός ιθανότητας σφάλματος διαμορφώσεων βασικής ζώνης
ask = qfunc(sqrt(Eb_N0));
psk = qfunc(sqrt(2*Eb_N0));
fsk = qfunc(sqrt(1.2*Eb_N0));

% Δημιουργία γραφικών παράστασέων 
figure;
loglog(Eb_N0, ask, 'b'); 
hold on;
loglog(Eb_N0, psk, 'r');
hold on;
loglog(Eb_N0, fsk, 'g');

xlabel('Eb/N0');
ylabel('Πιθανότητα Σφάλματος');
title('Πιθανότητα σφάλματος ζωνοπερατών διαμορφώσεων');
legend('ASK', 'PSK', 'FSK');

%! Η επίδοση ποιου συστήματος είναι η καλύτερη και γιατί?
% Η επίδοση του συστήματος με PSK είναι η καλύτερη αφού από
% την γραφική παράσταση έχει την μικρότερη πιθανότητα σφάλματος (άξονας y).

%! Με βάση τη γραφική παράσταση, όταν ο λόγος Eb/N ειναι 10 ποια ειναι η πιθανότητα λάθους για το 
%& α)ASK (κατάλληλη για περιβάλλοντα αυξημένου θορύβου)
% H πιθανότητα λάθους είναι περίπου 0.00078
%& β)PSK (Μικρότερη ανοχή στο θόρυβο όσο το Μ αυξάνει)
% H πιθανότητα λάθους είναι περίπου 0.00026
%& γ)FSK
% H πιθανότητα λάθους είναι περίπου 3.87*10^-6