x1 = load('handel.mat');

%sound(x1.y,x1.Fs);

%! Ποια είναι η συχνότητα δειγματοληψίας
disp('Η συχνότητα δειγματοληψίας για αρχικό ήχο:');
disp(x1.Fs);

Ts1 = 1/x1.Fs;
N1 = length(x1.y);
% πολλαπλασίασε για κάθε θέση του διανύσματος y με την περίοδο δειγματοληψίας για να βρεις τον χρόνο
t1 = (0:N1-1)*Ts1;

plot(t1,x1.y);
title('Γραφική Παράσταση ήχου');
xlabel('Χρόνος(t)');
ylabel('Δείγματα');

figure;
% Η downsample μειώνει τον ρυθμό δειγματοληψίας κατά 2
x2 = downsample(x1.y, 2); 
Fs2 = x1.Fs / 2;

Ts2 = 1/Fs2;
N2 = length(x2);
t2 = (0:N2-1)*Ts2;

plot(t1, x1.y);
hold on;
plot(t2, x2,'m');
title('Γραφική Παράσταση υποδειγματολημένου ήχου');
xlabel('Χρόνος(t)');
ylabel('Δείγματα');
legend('Αρχικός Ήχος','Υποδειγματοληπτημένος Ήχος');

sound(x2,Fs2);

disp('Η συχνότητα δειγματοληψίας για υποδειγματολημένο ήχο:');
disp(Fs2);
grid on;