% Τιμές για τον λόγο Eb/N0
Eb_N0 = 0:0.1:40;

% Υπολογισμός ιθανότητας σφάλματος διαμορφώσεων βασικής ζώνης
uni = qfunc(sqrt(Eb_N0));
ami = 1.5*qfunc(sqrt(Eb_N0));
bi = qfunc(sqrt(2*Eb_N0));

% Δημιουργία γραφικών παράστασέων 
figure;
loglog(Eb_N0, uni, 'b'); 
hold on;
loglog(Eb_N0, ami, 'r');
hold on;
loglog(Eb_N0, bi, 'g');

xlabel('Eb/N0');
ylabel('Πιθανότητα Σφάλματος');
title('Πιθανότητα σφάλματος διαμορφώσεων βασικής ζώνης');
legend('Μονοπολική σηματοδοσία', 'Αντιστροφή εναλλασσόμενου σημείου', 'Διπολική σηματοδοσία');

%! Η επίδοση ποιου συστήματος είναι η καλύτερη και γιατί?
% Η επίδοση του συστήματος με διπολική σηματοδοσία (bipolar) είναι η καλύτερη αφού απο 
% την γραφική παράσταση έχει την μικρότερη πιθανότητα σφάλματος.
%& Unipolar
% Δεν παρέχει ανίχνευση σφαλμάτων και δεν είναι ανθεκτικό στο θόρυβο
%& Bipolar
% Δεν επιτρέπει διόρθωση σφαλμάτων
%& AMI
% Eπιτρέπει διόρθωση σφαλμάτων