fx = 60;
A = 3;
Ts = 1/fx;
dt = Ts/100;
t = 0:dt:0.1;
x = A*cos(2*pi*fx*t);

% Συχνότητα δειγματοληψίας 400Hz
fs1 = 400; 
Ts1 = 1/fs1;
ts1 = 0:Ts1:0.1;
% Υπολογισμός του δειγματοληπτημένου σήματος
xs1 = A*cos(2*pi*fx*ts1);

% Συχνότητα δειγματοληψίας 70Hz
fs2 = 70; 
Ts2 = 1/fs2; 
ts2 = 0:Ts2:0.1;
% Υπολογισμός του δειγματοληπτημένου σήματος
xs2 = A*cos(2*pi*fx*ts2);

% Γραφική παράσταση σήματος και διεγματοληψίας 400Hz, 70Hz
plot(t,x, 'b-')
hold on;
stem(ts1,xs1,'r*');
hold on;
stem(ts2,xs2,'g*');
grid on;
title('Ημιτονοειδές Σήμα και Δειγματοληψία')
legend('Ημιτονοείδές','Δείγματα 400Hz','Δείγματα 70Hz');

%! Είναι επαρκη τα δείγματα και στις δύο περιπτώσεις για την αναπαράσταση του σήματος? 
%! Παρατηρείτε φαινόμενο aliasing?
% Είναι επαρκή το πρώτο δείγμα με 400Hz γιατί είναι μεγαλύτερη από fN = 2*fx = 120Hz ενώ 
% το δεύτερο δείγμα με 70Hz είναι μικρότερο οπότε παρατηρείται το φαινόμενο aliasing, αναδίπλωση του φάσματος.
% Δηλαδή η συχνότητα δειγματοληψίας 70Hz είναι πολύ χαμηλή για να καταγράψει σωστά το αρχικό σήμα, 
% οπότε γίνεται μια παραμορφωμένη αναπαράσταση του σήματος.
 
%!!! f_alias = 
f_alias = abs(fs2 - fx);
y = A*cos(2*pi*f_alias*t); 

figure;
subplot(2,1,1);
plot(t,y);
hold on;
stem(ts2,xs2,'g*');
title('Ημιτονοειδές σήμα με falias = fs2 - fx και δειγματοληψία 70Hz')

% Συχνότητα δειγματοληψίας FNyquist = 2*fmax = 2*fx = 120Hz
fs3 = 120;
Ts3 = 1/fs3;
ts3 = 0:Ts3:0.1;

% Υπολογισμός του δειγματοληπτημένου σήματος
xs3 = A*cos(2*pi*fx*ts3);

% Γραφική παράσταση σήματος και δειγματοληψίας fN
subplot(2,1,2)
plot(t,x)
hold on;
stem(ts3,xs3,'m*');
title('Ημιτονοειδές σήμα με δειγματοληψία fN = 120Hz')
grid on;

%! Πόσα δείγματα λαμβάνονται ανά μία περίοδο?
% Από το γράφημα βλέπουμε τρία δέιγματα ανά περίοδο.