m = 3; % γιατί n = 2^m - 1 = 7 άρα m = 3
[h, g, n, k] = hammgen(m);

%! Ποιος είναι ο πίνακας ελέγχου ισοτιμίας και ποιος ο γεννήτορας?
disp('Πίνακας ελέγχου ισοτιμίας (H):');
disp(h);
disp('Πίνακας γεννήτορας (G):');
disp(g);

%! Πόσα bits έχει η κωδική λέξη και πόσα bits έχει το µήνυµα πληροφορίας για το συγκεκριµένο κώδικα;
disp(['Κωδική λέξη: ', num2str(n), ' bits']);
disp(['Μήνυμα πληροφορίας: ', num2str(k), ' bits']);

%! Συμφωνεί η μορφή του πίνακα ελέγχου ισοτιμίας με τις θεωρητικές προδιαγραφές?
% Οι στήλες του πίνακα ελέγχου ισοτιμίας για έναν κώδικα Hamming 
% προκύπτουν από όλες τις μη μηδενικές δυαδικές ακολουθίες μήκους m.
% Δηλαδή στον Hamming (7,4) τους δυαδικούς αριθμούς 001, 010, 011, 100, 101, 110, 111 
% Που από το αποτέλεσμα βλέπουμε ότι η πρώτη στήλη ειναι 100, η δέυτερη 010 και η τρίτη 001 κτλ. 
% που αντιστοχόυν στους 3 bit δυαδικούς αριθμους εκτός απο το 000.

% Δημιουργία όλων των πιθανών δυαδικών μηνυμάτων
mes = de2bi(0:2^k-1);
disp('Δυαδικά μηνύματα:');
disp(mes);

% Κωδικοποίηση των μηνυμάτων
enc_mes = encode(mes, n, k, 'hamming');
disp('Κωδικοποιημένα Δυαδικά μηνύματα:');
disp(enc_mes);

% Ελάχιστη απόσταση του κώδικα
min_dist = gfweight(h);
disp(['Ελάχιστη απόσταση: ', num2str(min_dist)]);