% Γράψτε μία συνάρτηση H = myentropy(prob), η οποία θα υπολογίζει την εντροπία 
% Η μιας πηγής (όχι απαραίτητα δυαδικής) . Η συνάρτηση θα δέχεται ως όρισμα ένα 
% διάνυσμα p, που θα περιέχει τις πιθανότητες εμφάνισης (σχετικές συχνότητες) των 
% συμβόλων. Δεν χρειάζεται να περάσετε στη συνάρτηση τον αριθμό των συμβόλων, 
% ούτε τα ίδια τα σύμβολα.
% Επιθυμητό είναι η συνάρτηση να ελέγχει ότι τα στοιχεία του διανύσματος p (οι 
% πιθανότητες) βρίσκονται μεταξύ 0 και 1 και ότι το άθροισμά τους είναι περίπου 
% μονάδα.

function H=myentropy(prob)
    Hi=prob.*log2(1./(prob+1e-9));
    H=sum(Hi);    