n = -100:1:100;
x1 = cos(0.2 * pi * n + pi/3);
x2 = cos(0.1 * pi * n + pi/4);
x3 = cos(0.01 * pi * n + pi/5);

% Σχεδιασμός σημάτων x1,x2,x3
subplot(311)
stem(n, x1);
axis([min(n)-1 max(n)+1 -1.5 1.5]);
hold on;

subplot(312)
stem(n, x2);
axis([min(n)-1 max(n)+1 -1.5 1.5]);
hold on;

subplot(313)
stem(n, x3);
axis([min(n)-1 max(n)+1 -1.5 1.5]);
hold on;

% Περιοδικότητα x1,x2,x3
% Tα x1, x2, x3 είναι περιδικά γιατί είναι ημιτονοειδή σήματα
% Θεμελιώδης περίοδος του cos ειναι Ν = 2kπ/Ω
% Για το x1 έχω Ν1 = 2kπ/0.2 = 10kπ = 10π για k = 1
% Άρα ισχύει x1[n] = x1[n + 10] και απο το γράφημα βλέπω ότι είναι ίσα
N1 = 10; 
subplot(311)
stem(n - N1, x1);
axis([min(n)-1 max(n)+1 -1.5 1.5]);

% Για το x2 έχω Ν2 = 2kπ/0.1 = 20kπ = 20π για k = 1
% Άρα ισχύει x2[n] = x2[n + 20] και απο το γράφημα βλέπω ότι είναι ίσα
N2 = 20;
subplot(312)
stem(n - N2, x2);
axis([min(n)-1 max(n)+1 -1.5 1.5]);

% Για το x2 έχω Ν2 = 2kπ/0.01 = 200kπ = 200π για k = 1
% Άρα ισχύει x3[n] = x3[n + 200] και απο το γράφημα βλέπω ότι είναι ίσα

N3 = 200;
subplot(313)
stem(n - N3, x3);
axis([2*min(n)-1 max(n)+1 -1.5 1.5]);


% Σχεδιασμός σημάτων y,z

y = x1 + x2;
z = x1 + x2 + x3;

figure;
subplot(211)
stem(n,y)
axis([min(n)-1 max(n)+1 -1.5 1.5]);
hold on;

subplot(212)
stem(n,z)
axis([min(n)-1 max(n)+1 -3.5 3.5]);
hold on;

% Περιοδικότητα y,z
% Η Θεμελιώδης περίοδος του y θα είναι το ΕΚΠ των Ν1 και Ν2 που είναι οι
% θεμελιώδες περίοδοι το x1 και του x2 που αποτελείται το y
% Άρα Ν4 = ΕΚΠ(10,20) = 20
% Άρα ισχύει y[n] = y[n + 20] και απο το γράφημα βλέπω ότι είναι ίσα

N4 = 20;
subplot(211)
stem(n - N4,y)
axis([min(n)-1 max(n)+1 -1.5 1.5]);

% Η Θεμελιώδης περίοδος του z θα είναι το ΕΚΠ των Ν1,Ν2,N3
% Άρα Ν5 = ΕΚΠ(10,20,200) = 200
% Άρα ισχύει z[n] = z[n + 200] και απο το γράφημα βλέπω ότι είναι ίσα

N5 = 200;
subplot(212)
stem(n - N5,z)
axis([2*min(n)-1 max(n)+1 -3.5 3.5]);