n=0:40;
% είσοδος συστήματος
x = 2*cos(pi*n/8); % αθόρυβο σήμα
subplot(211)
stem(n,x);
legend("no noise");

x = 2*cos(pi*n/8) + randn(); % ενθόρυβο σήμα
subplot(212)
stem(n,x);
legend("with noise");

figure;
% συντελεστές y
a = 1;

% συντελεστές x
b = 0.25 * ones(1, 4); % γιατί το άθροισμα έχει τον ίδιο συντελεστή
y1 = filter(b, a, x);
stem(n, y1,'DisplayName','y1[n]')

% Η δράση του συστήματος στο ενθόρυβο σύστημα απλά μειώνει κατα 0.25
% το ύψος τους σήματος

hold on;
% συντελεστές y
a = 1;

% συντελεστές x
b = 0.125 * ones(1, 8); % γιατί το άθροισμα έχει τον ίδιο συντελεστή
y2 = filter(b, a, x);
stem(n, y2, 'g','DisplayName','y2[n]')
legend('show') 

% Το δεύτερο σήμα ειναι πιο κόντο σε ύψος σε σύγκριση με το πρώτο 
% (γιατί 0.25 > 0.125) και επειδή το άθροισμα είναι μέχρι m=7 έιναι και
% ολισθησμένο κατά 4 θέσεις δεξιά
