% α) κρουστική απόκριση
n=0:10;
% συντελεστές y
a = [1 3 -5];
% % συντελεστές x
b = [0.5 0 -2];
d = (n==0);
h=filter(b,a,d);
stem(n,h)
legend('h κρουστική');

% β) ευστάθεια (BIBO) για φραγμένη είσοδο, φραγμένη έξοδο
% Είναι ευσταθές γιατί βλέπουμε ότι για φραγμένη είσοδο x[n] η έξοδος
% κυμαίνεται στις τιμές (-1*10^5,4*10^5) δηλαδή δεν απειρίζεται είναι φραγμένη

% γ) 
figure;
x = [2 1 1 1 0 0 1 1 0 0 2];
% με conv
y2 = conv(h,x);

% με filter
x(20)=0;
y1 = filter(b,a,x);

% γράφημα στο ίδιο παράθυρο για να δω αν ταυτίζονται
stem(y2)
hold on;
stem(y1,'g*')
legend('γ)')

% Από το γράφημα βλέπουμε ότι δεν ταυτίζονται όλους τους όρους
% Δηλαδή βλέπουμε ότι το αποτέλεσμα της filter είναι σωστό ενώ της conv δεν
% είναι γιατί προσεγγίσαμε μια κρουστική απόκριση απείρων όρων με μια 
% κρουστική πεπερασμένων όρων

% δ)
figure;
n=0:10;
x = 2*cos(3*pi*n);

% με conv
y2 = conv(h,x);

% με filter
x(20)=0;
y1 = filter(b,a,x);

% γράφημα στο ίδιο παράθυρο για να δω αν ταυτίζονται
stem(y2)
hold on;
stem(y1,'g*')
legend('δ)')

% Στο γράφημα πάλι βλέπουμε ότι δεν ταυτίζονται  
% λόγω τους προαναφερόμενους λόγους